Revit 2016 API
LineLoad.Moment Property
Returns the three dimensional moment applied to one of the points for the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016.  Use Moment1 or Moment2 property instead.")]
public XYZ this[
	int index
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016.  Use Moment1 or Moment2 property instead.")> _
Public ReadOnly Property Moment ( _
	index As Integer _
) As XYZ
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016.  Use Moment1 or Moment2 property instead.")]
public:
property XYZ^ Moment[int index] {
	XYZ^ get (int index);
}
Parameters
index
Type: System.Int32
The index of the point to return.
Remarks
An index of 0 represents the start point and 1 represents the end point. The moment is measured in Feet*Kg / Sec.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace